name="Alex Buadze"
print(name)
age=15
print(age)
adress="Georgia, Tbilisi, 129 Nustubidze Str"
print(adress)
height="174cm"
print(height)
weight="65kg"
print(weight)


#//////////////////////////////////////////////////////////////////////////////////////////////////


print("Alex") #string მონაცემთა ტიპი რომელიც ტერმინალში უშვებს რაც ბრჭყალების შუაში არის მოცემული
print(91) #integer მონაცემთა ტიპი ტიპი რომელიც ტერმინალში მხოლოდ მთელი, უარყოფითი და დადებითი რიცხვების გაშვება შეუძლია
print(2.2) #float მხოლოდ და მხოლოდ ათწილადების მონაცემი.
#name არის თვით მონაცემის სახელი, რომელსაც შეგვიძლია ნებისმიერი რამ დავარქვათ.

#DECLARATION ანუ დეკლარაცია არის ცვლადის დასახელება, მაგალითად:
fruit=("banana")
#ამ შემთხვევაში "game" არის ჩვენი ცვლადის სახელი

#მინიჭების ოპერატორი არის (=)
#Initialization ანუ ინიციალიზაცია არის ბრჭყალების ქვეშ მოქცეული ტექსტის შეტანა, ანუ ცვლადში რასაც ვინახავთ, მაგალითად
place=("france")
#ამ შემთხვევაში ("france") არის

#reinitialization ანუ რეინიცილიზაცია არის ცვლადის განახლება, ანუ:
fruit=("apple")
print(fruit)
#ტერმინალში ამოიბეჭდება apple რადგან ჩვენ რეინიციალიზაცია მოვახდინეთ
